# St7SetHRABaseVector

Assigns the base excitation vector for harmonic response analysis.

long St7SetHRABaseVector(long uID, double* Doubles)
Input Parameters
uID
Strand7 model file ID.
Doubles[0..2]
A 3-element array containing the base excitation vector.